app/app/controllers/rank_images_controller.rb

SELECT * FROM "rank_images" WHERE ("rank_images"."id" = 2)
---
  def show
    @rank_image = RankImage.find(params[:id])

INSERT INTO "rank_images" ("image_file_size", "updated_at", "tags", "image_content_type", "image_file_name", "created_at") VALUES(67220, '2009-05-18 15:27:32', NULL, 'image/jpeg', 'bear_fight1.jpg', '2009-05-18 15:27:32')
---
  def create
    @rank_image = RankImage.new(params[:rank_image])
    if @rank_image.save then