app/app/controllers/stored_images_controller.rb

  def show
    @image = StoredImage.find(params[:id])
---
SELECT * FROM "stored_images" WHERE ("stored_images"."id" = 1)